{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "cropping": [[22, 0], [0, 0]], "name": "cropping2d_2", "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_3", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\tNVIDIA.py\u00da\u0006resize\f\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null]}, "class_name": "Lambda"}, {"config": {"output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_4", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\tNVIDIA.py\u00da\tnormalize\u0010\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null]}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_6", "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_filter": 24, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_6"}, "class_name": "SpatialDropout2D"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_7", "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_filter": 36, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_7"}, "class_name": "SpatialDropout2D"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_8", "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_filter": 48, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_8"}, "class_name": "SpatialDropout2D"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_9", "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_filter": 64, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_9"}, "class_name": "SpatialDropout2D"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_10", "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_filter": 64, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "spatialdropout2d_10"}, "class_name": "SpatialDropout2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_5", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": 1152, "activation": "linear", "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_6", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": 100, "activation": "linear", "output_dim": 50}, "class_name": "Dense"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_7", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": 50, "activation": "linear", "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_8", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": 10, "activation": "linear", "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}